Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.master-node will be created
+ resource "yandex_compute_instance" "master-node" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: lebedevai
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC9uNCRS8Ww0cZCA1iYv0nFa2WCXpZlNiyBKxdp0zuVUOc+udLWo8dOJvstyDZFenA/Fb3lWSXvaqtKBAYm8utGate89aujGra7/nhzsOTEzLY8ZlhLZFU4I7lbhzpVd3sNxUF8WAoQTYYiMxC+i3I1Qli/mlL7BpAGFxouB61pdH+i0iYqrYxtzb/g/N8H1n2lMlm3diutn6olTpMZNvPfpoK7vDknFTnKuO5ITHaJu9XKGzuMZcAp97DG7a2SWpe2M9UR7aFqcQxButLvOMyvJeLImhdyIb34RkOXWygno13Pk3CfPIE5/fOyST/zuBRbbqDQURsQAaGUaly0PZjF
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    groups: sudo
                    shell: /bin/bash
                package_update: true
                package_upgrade: true
                packages:
                  - nginx
                  - nano
                  - software-properties-common
                runcmd:
                  - mkdir -p /home/lebedevai/.ssh
                  - chown -R lebedevai:lebedevai /home/lebedevai/.ssh
                  - chmod 700 /home/lebedevai/.ssh
                  - sudo add-apt-repository ppa:deadsnakes/ppa -y
                  - sudo apt-get update
            EOT
        }
      + name                      = "control-plane"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd893ak78u3rh37q3ekn"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 4
          + memory        = 16
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.worker[0] will be created
+ resource "yandex_compute_instance" "worker" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: lebedevai
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC9uNCRS8Ww0cZCA1iYv0nFa2WCXpZlNiyBKxdp0zuVUOc+udLWo8dOJvstyDZFenA/Fb3lWSXvaqtKBAYm8utGate89aujGra7/nhzsOTEzLY8ZlhLZFU4I7lbhzpVd3sNxUF8WAoQTYYiMxC+i3I1Qli/mlL7BpAGFxouB61pdH+i0iYqrYxtzb/g/N8H1n2lMlm3diutn6olTpMZNvPfpoK7vDknFTnKuO5ITHaJu9XKGzuMZcAp97DG7a2SWpe2M9UR7aFqcQxButLvOMyvJeLImhdyIb34RkOXWygno13Pk3CfPIE5/fOyST/zuBRbbqDQURsQAaGUaly0PZjF
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    groups: sudo
                    shell: /bin/bash
                package_update: true
                package_upgrade: true
                packages:
                  - nginx
                  - nano
                  - software-properties-common
                runcmd:
                  - mkdir -p /home/lebedevai/.ssh
                  - chown -R lebedevai:lebedevai /home/lebedevai/.ssh
                  - chmod 700 /home/lebedevai/.ssh
                  - sudo add-apt-repository ppa:deadsnakes/ppa -y
                  - sudo apt-get update
            EOT
        }
      + name                      = "worker-node-1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd893ak78u3rh37q3ekn"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 4
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.worker[1] will be created
+ resource "yandex_compute_instance" "worker" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: lebedevai
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC9uNCRS8Ww0cZCA1iYv0nFa2WCXpZlNiyBKxdp0zuVUOc+udLWo8dOJvstyDZFenA/Fb3lWSXvaqtKBAYm8utGate89aujGra7/nhzsOTEzLY8ZlhLZFU4I7lbhzpVd3sNxUF8WAoQTYYiMxC+i3I1Qli/mlL7BpAGFxouB61pdH+i0iYqrYxtzb/g/N8H1n2lMlm3diutn6olTpMZNvPfpoK7vDknFTnKuO5ITHaJu9XKGzuMZcAp97DG7a2SWpe2M9UR7aFqcQxButLvOMyvJeLImhdyIb34RkOXWygno13Pk3CfPIE5/fOyST/zuBRbbqDQURsQAaGUaly0PZjF
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    groups: sudo
                    shell: /bin/bash
                package_update: true
                package_upgrade: true
                packages:
                  - nginx
                  - nano
                  - software-properties-common
                runcmd:
                  - mkdir -p /home/lebedevai/.ssh
                  - chown -R lebedevai:lebedevai /home/lebedevai/.ssh
                  - chmod 700 /home/lebedevai/.ssh
                  - sudo add-apt-repository ppa:deadsnakes/ppa -y
                  - sudo apt-get update
            EOT
        }
      + name                      = "worker-node-2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd893ak78u3rh37q3ekn"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 4
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_vpc_network.my_vpc will be created
+ resource "yandex_vpc_network" "my_vpc" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "my-vpc"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.public_subnet[0] will be created
+ resource "yandex_vpc_subnet" "public_subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-ru-central1-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.0/28",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.public_subnet[1] will be created
+ resource "yandex_vpc_subnet" "public_subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-ru-central1-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.16/28",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.public_subnet[2] will be created
+ resource "yandex_vpc_subnet" "public_subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-ru-central1-d"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.32/28",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ master_node_external_ip   = (known after apply)
+ master_node_internal_ip   = (known after apply)
+ master_node_name          = "control-plane"
+ subnet_ids                = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
+ subnet_ips                = [
      + [
          + "192.168.1.0/28",
        ],
      + [
          + "192.168.1.16/28",
        ],
      + [
          + "192.168.1.32/28",
        ],
    ]
+ subnet_names              = [
      + "public-ru-central1-a",
      + "public-ru-central1-b",
      + "public-ru-central1-d",
    ]
+ subnet_zones              = [
      + "ru-central1-a",
      + "ru-central1-b",
      + "ru-central1-d",
    ]
+ vpc_name                  = "my-vpc"
+ worker_nodes_external_ips = [
      + (known after apply),
      + (known after apply),
    ]
+ worker_nodes_internal_ips = [
      + (known after apply),
      + (known after apply),
    ]
+ worker_nodes_names        = [
      + "worker-node-1",
      + "worker-node-2",
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://5e9f391a81ba:4141/lock?id=luckynuckywinkel%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
